Revit 2024 API
CancellationListener Methods
The CancellationListener type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Returns true if the operation associated with this instance has been cancelled.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
CancellationListener Class
Autodesk.Revit.DB Namespace